from faker.providers import BaseProvider
import random

class Provider(BaseProvider):

    """ Afghan complete address provider in Pashto. """

    provinces = [

        "بدخشان", "بدغيس", "بغلان", "بلخ", "باميان", "پکتيا", "پکتيکا", "پروان", "پنجشېر", "تخار",

        "دايکندي", "جوزجان", "اروزګان", "زابل", "سمنگان", "سرپل", "غور", "غزني", "فارياب",

        "فراه", "کابل", "کاپيسا", "کندهار", "کندز", "کونړ", "لغمان", "لوګر", "ميدان وردک",

        "نيمروز", "ننګرهار", "نورستان", "هلمند", "هرات", "خوست"

    ]

    cities = {

        "بدخشان": ["فيض آباد"],

        "بدغيس": ["قلعه نو"],

        "بغلان": ["پلخمري"],

        "بلخ": ["مزار شريف"],

        "باميان": ["باميان"],

        "دايکندي": ["نيلي"],

        "فراه": ["فراه"],

        "فارياب": ["ميمنه"],

        "غور": ["چغچران"],

        "غزني": ["غزني"],

        "هلمند": ["لښکرګاه"],

        "هرات": ["هرات"],

        "جوزجان": ["شبرغان"],

        "کابل": ["کابل"],

        "کاپيسا": ["محمود راقي"],

        "کندهار": ["کندهار"],

        "کندز": ["کندز"],

        "کونړ": ["اسدآباد"],

        "خوست": ["خوست"],

        "لغمان": ["مهترلام"],

        "لوګر": ["پل علم"],

        "ميدان وردک": ["ميدان ښار"],

        "نيمروز": ["زرنج"],

        "ننګرهار": ["جلال آباد"],

        "نورستان": ["پارون"],

        "اروزګان": ["ترينکوټ"],

        "پکتيا": ["ګرديز"],

        "پکتيکا": ["شرانه"],

        "پنجشېر": ["بازارک"],

        "پروان": ["چاريکار"],

        "سمنگان": ["ايبک"],

        "سرپل": ["سرپل"],

        "تخار": ["تالقان"],

        "زابل": ["قلات"]

    }

    # Districts for all provinces (full)
    districts = {
        "کابل": ["کابل ښار", "سرای شمالي", "سوروبي", "قره باغ", "بګرامي", "ده سبز", "پغمان", "استالف", "فرزه", "ګلدره",
                 "خواجه رواش", "کلکان", "مېر بچه کوټ", "مصاحي", "شاکردره", "چشت شريف", "موسیاهي"],
        "پروان": ["چاريکار", "جبل السراج", "سياه ګرد", "شينوارو", "کوهستان", "سورخي پارسا", "سالنګ", "شيخ علي",
                  "غوربند", "بګرام"],
        "کاپيسا": ["محمود راقي", "نجراب", "تاګاب", "کهمرد", "حصه اول کوهستان", "حصه دوم کوهستان", "اله ساي"],
        "پنجشېر": ["بازارک", "پريان", "دره", "انابه", "رخه", "پشغور", "شتل", "عبدالله خېل"],
        "بغلان": ["پلخمري", "دهنه غوري", "اندراب", "برکه", "بغلان جديد", "دوشي", "فرنګ و غارو", "ګوزرګاه نور", "خنجان",
                  "خوست و فرنګ", "نهرين", "پل حصار", "تاله و برفک", "کلګي"],
        "بادغيس": ["قلعه نو", "آب کمري", "بالا مرغاب", "جوند", "غورماچ", "مقر", "قادس"],
        "بدخشان": ["فيض آباد", "ارګو", "ارغنج خواه", "بهارک", "درايم", "اشکاشم", "جرم", "خاش", "خوان", "کشيم", "کوف آب",
                   "کرآن و منجان", "ميمي", "نساي", "راغستان", "شهدا", "شغننان", "شکي", "شوهدا", "تګاب", "تشکان",
                   "واخان", "وردوج", "يفتل سفلي", "يمگان", "يوان", "زيباک"],
        "بلخ": ["مزارشريف", "بلخاب", "چمتال", "چاربولک", "چارکنت", "دهدادي", "دولت آباد", "شولګره", "کلدار", "خلم",
                "کشک رباط سنګي", "مارمل", "نهر شاهي", "شورتپه", "زارع"],
        "باميان": ["باميان", "يکاولنګ", "کهمرد", "پنجاب", "سيغان", "شبر", "وراس", "سيدآباد"],
        "دايکندي": ["نيلي", "اشترلي", "خدير", "ګيزاب", "ميرامور", "نور", "سنګ تخت", "کجران", "شارستان"],
        "فراه": ["فراه", "اناردره", "بالابلوک", "بکواه", "ګلستان", "خاک سفيد", "لاش و جوين", "پرچمن", "پشت رود",
                 "قلعه کاه", "شيب کوه"],
        "فارياب": ["ميمنه", "المار", "اندخوي", "بلچراغ", "دولت آباد", "غورماچ", "خان چارباغ", "خواجه سبزپوش", "قرغان",
                   "قرامقول", "قيصار", "شيرين تګاب", "پشتونکوټ", "ګرزيوان"],
        "غور": ["فيروزکوه", "چغچران", "دولينه", "دشتي قلعه", "لعل و سرجنګل", "مرغاب", "پسابند", "ساغر", "شهرک",
                "تايواره", "تولک"],
        "غزني": ["غزني", "آب بند", "اجرستان", "اندر", "ده يک", "ګيرو", "جاغوري", "جغتو", "خواجه عمري", "مالستان",
                 "موکر", "ناهور", "ناوه", "قره باغ", "رشيدان", "زنخان", "عباس بند", "واغظ"],
        "هلمند": ["لښکرګاه", "نهر سراج", "نادعلي", "ناوه بشتر", "ګرمسير", "ديشو", "سنګين", "واشير", "کجکي", "موسي قلعه",
                  "باغران", "ريګ", "نوازاد"],
        "هرات": ["هرات", "ادريسکين", "انجيل", "چشت شريف", "فارسي", "غوريان", "ګلران", "ګذره", "ګوزره", "زنده جان",
                 "کرخ", "کشک رباط سنګي", "کشک کهنه", "اوبه", "پشتون زرغون", "تيرپل"],
        "جوزجان": ["شبرغان", "آقچه", "درزاب", "فيض آباد", "خانقاه", "خم آب", "خواجه دوکوه", "مرديان", "منګجک", "قرقين",
                   "قوش تپه"],
        "کندهار": ["کندهار", "ارغنداب", "ارغستان", "دند", "غورک", "خاکريز", "معروف", "ميوند", "نېش", "پنجوايي",
                   "شاه ولي کوټ", "شورابک", "تخته پل", "ژړۍ", "سپين بولدک"],
        "کندز": ["کندز", "امام صاحب", "علي آباد", "ارچي", "چاردره", "خان آباد", "قلعه زال"],
        "کونړ": ["اسدآباد", "برکنت", "چوکي", "دانګام", "دره پيچ", "غازي آباد", "کامه", "مروړه", "نرنګ", "نورګل", "شلتن",
                 "سرکانو", "ناري", "واټپور"],
        "خوست": ["خوست", "باک", "ګربز", "اسماعيل خېل و منډوزي", "موسي خېل", "نادشاه کوټ", "قلعه قلندر", "صبري", "شميال",
                 "سپرې", "تره زي", "تني"],
        "لغمان": ["مهترلام", "عليشنګ", "الينګار", "دولت شاه", "قرغيي", "بدپښ"],
        "لوګر": ["پل علم", "ازره", "برکي برک", "خروار", "خوشي", "محمدآغه", "چرخ"],
        "ميدان وردک": ["ميدان ښار", "چک", "حصه اول بهسود", "حصه دوم بهسود", "جلريز", "مرکز بهسود", "نرخ", "سيدآباد",
                       "ديه يک"],
        "ننګرهار": ["جلال آباد", "اچين", "بټي کوټ", "بهسود", "چپرهار", "دربابه", "دور بابا", "غني خېل", "ګوشته",
                    "حصارک", "خګياڼي", "کوز کونړ", "کوټ", "لعل پور", "مهمنددره", "نازيان", "پچيراګام", "رودات",
                    "شيرزاد", "شينوار", "سرخ رود"],
        "نيمروز": ["زرنج", "چخانسور", "چاربرجک", "خاش رود", "کنګ", "دلارام"],
        "نورستان": ["پارون", "بارکنت", "دوآب", "کامديش", "ماندهول", "نورګرام", "وايګل", "ورمامي"],
        "پکتيا": ["ګرديز", "احمدآباد", "چمکني", "دندپټان", "ګرده سيري", "جاجي", "جاني خېل", "لجه منګل", "ميرزکه",
                  "پټان", "روحاني بابا", "سيدکرم", "شواک", "وزي زدران", "زدران", "زرمت"],
        "پکتيکا": ["شران", "برمل", "ديله", "ګيان", "ګومل", "جاني خېل", "متاخان", "نکه", "ارګون", "سرحوضه", "تروه",
                   "ارګستان", "ورمامي", "وزي خواه", "يوسف خېل", "زرغون ښار", "زيړوک"],
        "سمنگان": ["ايبک", "دره صوف بالا", "دره صوف پايين", "فيض آباد", "هزارسموچ", "خرم و سارباغ", "روي دوآب"],
        "سرپل": ["سرپل", "بلخاب", "ګوسفندي", "سانچارک", "سوزمه قلعه", "کوهستانات", "شيرين تګاب"],
        "تخار": ["تالقان", "اشکمښ", "بنگي", "بهارک", "چاه آب", "چال", "دشت قلعه", "فرخار", "هزاره سموچ",
                 "خاجه بهاءالدين", "خاجه غار", "نمک آب", "رستاق", "ورسک", "ينګي قلعه"],
        "اروزګان": ["ترينکوټ", "چوره", "دهراود", "ګيزاب", "خاص اروزګان", "شهيد حساس", "چنارتو"],
        "زابل": ["قلات", "ارغنداب", "اتغر", "دايه چوپان", "ميزان", "نوبهار", "شامليزي", "شينکي", "شهري صفا",
                 "ترنک و جلدک", "سيوري"]
    }

    streets = [

        "اصلي سړک", "بازار سړک", "پوهنتون سړک", "ښوونځي سړک", "روغتون سړک", "میدان سړک",

        "څلورلاره", "کوڅه نمبر ۱", "کوڅه نمبر ۲", "د ولسوالۍ سړک", "اداري سړک",

        "مسجد سړک", "کارته سړک", "جاده ميوند", "جاده احمد شاه بابا", "سړک دارالامان",

        "سړک خوشال خان", "کوڅه شهید", "سړک نادر خان", "بازار کوڅه", "کوڅه ګل فروښي",

        "سړک پل محمود خان", "جاده جلال آباد", "سړک کمپنۍ", "کوڅه وزیر اکبر خان",

        "سړک شیرشاه سوري", "مکروریان کوڅه ", "سړک قطعه ولسوالي"

    ]

    def province(self):
        return random.choice(self.provinces)

    def city(self, province=None):
        if province is None:
            province = self.province()
        return random.choice(self.cities.get(province, [province]))

    def district(self, province=None):
        if province is None:
            province = self.province()
        return random.choice(self.districts.get(province, [province]))

    def street(self):
        return random.choice(self.streets)

    def postalcode(self):
        return str(random.randint(10000, 99999))

    def address(self):
        province = self.province()
        city = self.city(province)
        district = self.district(province)
        street = self.street()
        postal = self.postalcode()
        return f"{street}, {district} ولسوالی, {city} ښار, {province}, {postal}"
