# -*- coding: utf-8 -*-

from __future__ import unicode_literals
from .. import Provider as PersonProvider


class Provider(PersonProvider):
    formats = (
        '{{first_name}} {{last_name}}', '{{first_name}} {{last_name}}',
        '{{first_name}} {{last_name}}',
        '{{first_name}} {{last_name}}',
        '{{first_name}} {{last_name}}',
        '{{first_name}} {{last_name}}',
        '{{prefix}} {{first_name}} {{last_name}}, {{prefix}} {{first_name}} {{last_name}} {{suffix}}','{{first_name}} {{last_name}} {{suffix}}')

    # Thai prefix
    # http://www.stou.ac.th/thai/grad_stdy/Apply/prefix.asp

    prefixes_female = (
        "พลเอก", "พลโท", "พลตรี", "พันเอก", "พันโท", "พันตรี", "ร้อยเอก", "ร้อยโท",
        "ร้อยตรี",
        "จ่าสิบเอก", "จ่าสิบโท", "จ่าสิบตรี", "สิบเอก", "สิบโท", "สิบตรี", "พลทหาร",
        "พลเรือเอก", "พลเรือโท", "พลเรือตรี", "นาวาเอก", "นาวาโท", "นาวาตรี", "เรือเอก",
        "เรือโท", "เรือตรี", "พันจ่าเอก", "พันจ่าโท", "พันจ่าตรี", "จ่าเอก", "จ่าโท",
        "จ่าตรี", "พลทหาร", "พลอากาศเอก", "พลอากาศโท", "พลอากาศตรี", "นาวาอากาศเอก",
        "นาวาอากาศโท", "นาวาอากาศตรี", "เรืออากาศเอก", "เรืออากาศโท", "เรืออากาศตรี",
        "พันจ่าอากาศเอก", "พันจ่าอากาศโท", "พันจ่าอากาศตรี", "จ่าอากาศเอก", "จ่าอากาศโท",
        "จ่าอากาศตรี", "พลทหาร", "พลตำรวจเอก", "พลตำรวจโท", "พลตำรวจตรี", "พันตำรวจเอก",
        "พันตำรวจโท", "พันตำรวจตรี", "ร้อยตำรวจเอก", "ร้อยตำรวจโท", "ร้อยตำรวจตรี",
        "นายดาบตำรวจ", "จ่าสิบตำรวจ", "สิบตำรวจเอก", "สิบตำรวจโท", "สิบตำรวจตรี",
        "พลตำรวจ", "นาง", "นางสาว", "หม่อมหลวง", "หม่อมราชวงศ์", "พล.อ.",
        "พล.ท.", "พล.ต.", "พ.อ.", "พ.ท.", "พ.ต.", "ร.อ.", "ร.ท.", "ร.ต.", "จ.ส.อ.",
        "จ.ส.ท.",
        "จ.ส.ต.", "ส.อ.", "ส.ท.", "ส.ต.", "พลฯ", "พล.ร.อ.", "พล.ร.ท.", "พล.ร.ต.", "น.อ.",
        "น.ท.", "น.ต.", "ร.อ.", "ร.ท.", "ร.ต.", "พ.จ.อ.", "พ.จ.ท.", "พ.จ.ต.", "จ.อ.",
        "จ.ท.",
        "จ.ต.", "พลฯ", "พล.อ.อ.", "พล.อ.ท.", "พล.อ.ต.", "น.อ.", "น.ท.", "น.ต.", "ร.อ.",
        "ร.ท.", "ร.ต.", "พ.อ.อ.", "พ.อ.ท.", "พ.อ.ต.", "จ.อ.", "จ.ท.", "จ.ต.", "พลฯ",
        "พล.ต.อ.", "พล.ต.ท.", "พล.ต.ต.", "พ.ต.อ.", "พ.ต.ท.", "พ.ต.ต.", "ร.ต.อ.", "ร.ต.ท.",
        "ร.ต.ต.", "ด.ต.", "จ.ส.ต.", "ส.ต.อ.", "ส.ต.ท.", "ส.ต.ต.", "พลฯ", "ม.ล.", "ม.ร.ว.")

    prefixes_male = (
        "พลเอก", "พลโท", "พลตรี", "พันเอก", "พันโท", "พันตรี", "ร้อยเอก", "ร้อยโท",
        "ร้อยตรี",
        "จ่าสิบเอก", "จ่าสิบโท", "จ่าสิบตรี", "สิบเอก", "สิบโท", "สิบตรี", "พลทหาร",
        "พลเรือเอก", "พลเรือโท", "พลเรือตรี", "นาวาเอก", "นาวาโท", "นาวาตรี", "เรือเอก",
        "เรือโท", "เรือตรี", "พันจ่าเอก", "พันจ่าโท", "พันจ่าตรี", "จ่าเอก", "จ่าโท",
        "จ่าตรี", "พลทหาร", "พลอากาศเอก", "พลอากาศโท", "พลอากาศตรี", "นาวาอากาศเอก",
        "นาวาอากาศโท", "นาวาอากาศตรี", "เรืออากาศเอก", "เรืออากาศโท", "เรืออากาศตรี",
        "พันจ่าอากาศเอก", "พันจ่าอากาศโท", "พันจ่าอากาศตรี", "จ่าอากาศเอก", "จ่าอากาศโท",
        "จ่าอากาศตรี", "พลทหาร", "พลตำรวจเอก", "พลตำรวจโท", "พลตำรวจตรี", "พันตำรวจเอก",
        "พันตำรวจโท", "พันตำรวจตรี", "ร้อยตำรวจเอก", "ร้อยตำรวจโท", "ร้อยตำรวจตรี",
        "นายดาบตำรวจ", "จ่าสิบตำรวจ", "สิบตำรวจเอก", "สิบตำรวจโท", "สิบตำรวจตรี",
        "พลตำรวจ",
        "นาย", "บาทหลวง", "หม่อมหลวง", "หม่อมราชวงศ์", "สามเณร", "พระ",
        "พระอธิการ", "เจ้าอธิการ", "พระปลัด", "พระสมุห์", "พระใบฎีกา", "พระครูปลัด",
        "พระครูสมุห์", "พระครูใบฎีกา", "พระมหา", "พระครูธรรมธร", "พระครูวินัยธร", "พล.อ.",
        "พล.ท.", "พล.ต.", "พ.อ.", "พ.ท.", "พ.ต.", "ร.อ.", "ร.ท.", "ร.ต.", "จ.ส.อ.",
        "จ.ส.ท.",
        "จ.ส.ต.", "ส.อ.", "ส.ท.", "ส.ต.", "พลฯ", "พล.ร.อ.", "พล.ร.ท.", "พล.ร.ต.", "น.อ.",
        "น.ท.", "น.ต.", "ร.อ.", "ร.ท.", "ร.ต.", "พ.จ.อ.", "พ.จ.ท.", "พ.จ.ต.", "จ.อ.",
        "จ.ท.",
        "จ.ต.", "พลฯ", "พล.อ.อ.", "พล.อ.ท.", "พล.อ.ต.", "น.อ.", "น.ท.", "น.ต.", "ร.อ.",
        "ร.ท.", "ร.ต.", "พ.อ.อ.", "พ.อ.ท.", "พ.อ.ต.", "จ.อ.", "จ.ท.", "จ.ต.", "พลฯ",
        "พล.ต.อ.", "พล.ต.ท.", "พล.ต.ต.", "พ.ต.อ.", "พ.ต.ท.", "พ.ต.ต.", "ร.ต.อ.", "ร.ต.ท.",
        "ร.ต.ต.", "ด.ต.", "จ.ส.ต.", "ส.ต.อ.", "ส.ต.ท.", "ส.ต.ต.", "พลฯ", "ม.ล.", "ม.ร.ว.")

    prefixes = prefixes_female + prefixes_male

    # female first name
    # http: // www.mamaexpert.com / posts / content - 1166
    first_names_female = (
    "กัสจัง", "เกรซ", "เกรส", "แก้ม", "ข้าวสวย", "ข้าวหอม", "ข้าวทิพย์", "ข้าวปุ้น",
    "แจน", "ณิชา", "นินิว", "นานา", "นิว", "นับตังค์", "เนเน่", "น้ำมนต์", "โบวี่",
    "โบนัส", "บิวตี้", "ใบเตย", "ใบบัว", "ใบข้าว", "ใบตอง", "ใบเฟิร์น", "พรีช", "พอใจ",
    "พอเพียง", "ฟ้าใส", "เฟิร์ส", "เฟสบุค", "เฟสบุ๊ค", "ต้นข้าว", "ต้นหอม", "แตงกว่า",
    "แตงโม", "ตังค์", "ตังค์", "มิวสิค", "มะนาว", "มิ๊น", "มิ๊นท์", "มินนี่", "บัว",
    "ปันปัน", "แพท", "แพต", "แพทตี้", "เเพทตี้", "ลูกพีช", "ภูมิใจ", "เอิร์น", "เอิน",
    "เอวา", "เอมิ", "เอมี่", "ออมสิน", "ออกัส", "ไอซ์",)

    # male first name
    ##http: // www.mamaexpert.com / posts / content - 1166
    first_names_male = (
    "กันต์", "กันย์", "กาย", "กัปตัน", "กูเกิ้ล", "ขุนพล", "ข้าวปั้น", "คุณ", "เจ้าคุณ",
    "เจ้าขุน", "เจ้านาย", "ช็อปเปอร์", "โชกุน", "ชิณณ์", "ชิน", "ตุล", "ตุลย์", "โตโน่",
    "ตะวัน", "ไตตั้น", "ไตเติ้ล", "ปกป้อง", "ต้นน้ำ", "ต้นกล้า", "นะโม", "ไบรท์", "เบส",
    "ปลื้ม", "ปุณ", "ปุณณ์", "ปุญญ์", "แทนคุณ", "ธัน", "ธันวา", "พอร์ช", "พัตเตอร์",
    "พอร์ตเตอร์", "พอตเตอร์", "ฟลุ๊ก", "ฟลุ๊ค", "เฟสบุ๊ค", "ภาคิน", "ภูมิ", "ภูผา",
    "ภาคภูมิ", "ภู", "ภูมิใจ", "มาวิน", "มีคุณ", "ออโต้", "ออดี้", "อิ๊คิว", "อิคคิว",
    "อิคคิวซัง", "อิกคิว", "อะตอม", "ไอซ์", "อั่งเปา", "ออกัส", "อชิ", "อะชิ", "เอิร์ธ",
    "กันต์", "กันย์", "กาย", "กัปตัน", "กูเกิ้ล", "ขุนพล", "ข้าวปั้น", "คุณ", "เจ้าคุณ",
    "เจ้าขุน", "เจ้านาย", "ช็อปเปอร์", "โชกุน", "ชิณณ์", "ชิน", "ตุล", "ตุลย์", "โตโน่",
    "ตะวัน", "ไตตั้น", "ไตเติ้ล", "ปกป้อง", "ต้นน้ำ", "ต้นกล้า", "นะโม", "ไบรท์", "เบส",
    "ปลื้ม", "ปุณ", "ปุณณ์", "ปุญญ์", "แทนคุณ", "ธัน", "ธันวา", "พอร์ช", "พัตเตอร์",
    "พอร์ตเตอร์", "พอตเตอร์", "ฟลุ๊ก", "ฟลุ๊ค", "เฟสบุ๊ค", "ภาคิน", "ภูมิ", "ภูผา",
    "ภาคภูมิ", "ภู", "ภูมิใจ", "มาวิน", "มีคุณ", "ออโต้", "ออดี้", "อิ๊คิว", "อิคคิว",
    "อิคคิวซัง", "อิกคิว", "อะตอม", "ไอซ์", "อั่งเปา", "ออกัส", "อชิ", "อะชิ", "เอิร์ธ",)

    first_names = first_names_female + first_names_male
    # last name
    # http://www.reurnthai.com/index.php?topic=5273.45

    last_names = (
    "ดำริห์ชอบ", "ดวงทับทิม", "ดิศดใน", "ดัตพันธุ์", "ดุษฎีวนิช", "ดาบเพ็ชร์",
    "ดิสกะประกาย", "เดชคุ้ม", "ดาวกระจาย", "ดาบเงิน", "ดีตพันธุ์", "ดุริยพันธุ์",
    "ดาวอร่าม", "เดชวา", "ติระคมน์", "ไตรบรรพ", "ตระกูลบุญ", "เตมิยะเดช", "ตวงทอง",
    "แต้กุล", "ตรีครุธพันธุ์", "ตัณฑนุช", "ตั้งกุลงาม", "ตระกูลไม้เรียง", "ตะละภัฏ",
    "ตั้งเผ่า", "ตันเผ่า", "เตชะกำพุ", "ตัณสถิตย์", "ตราชู", "ตวันเยี่ยม", "ตรีเภรินทร์",
    "ตันตราจิณ", "ตั้งรบ", "ถนัดกลึง", "ถนอมมนุษย์", "ถนัดอักษร", "ถนัดการยนต์",
    "ถนัดหัดถกรรม", "ถาวรายุศม์", "ถนัดการเขียน", "ถาวรรัตน", "ถนัดพิมพการ", "ถ้วนศรี",
    "ถนอมพล", "ถาวระวรณ์", "ถนัดรบ", "ถนอมกุลบุตร", "ถมปัด", "ถนัดภาษา", "ถนัดเดินข่าว",
    "ถนัดรักษา", "ถนิมมาศ", "ถมังรักษสัตว์", "แถมธน", "ถะเกิงชศ", "ถิรสวัสดิ์",
    "ถนัดอาวุธ", "ถุงเงิน", "ทุมะบุตร์", "ทองประดิฐ", "ทรงโกมล", "ทัศนสุทธิ", "ทหารแท้",
    "ทองอยู่", "ทำประดู่", "ทรัพย์สาร", "ทีฆะ", "ทวนทอง", "ไทยสุชาต", "ทันยุค", "ไทนิยม",
    "ทองลาภ", "ทองเนื้อดี", "ทองแท้", "ทวีเดช", "ทับทิมไทย", "ทองสินธุ์", "ไทไชโย",
    "ทวนไชย์", "ทองสุกเลิศ", "ไทยแท้", "ทองสีไพล", "ธรรมนิยม", "ธนประทีป", "ธรรมเมธา",
    "ธุวะนุติ์", "ธาราธร", "ธีวร", "ธัญเสถียร", "ธนูปกรณ์", "เธียรายัน", "ธรรมฤดี",
    "ธัญาโภชน์", "ธนรักษ์", "ธูปะวิโรจน์", "ธูปหอม", "แนวพนิช", "นักสำหรวจ", "นฤทุกข์",
    "นาฏคายี", "เนื่องนนท์", "น้ำทิพย์", "เนื้อนุ่ม", "นวลฉวี", "นาคพันธุ์", "นำธวัช",
    "แน่นดุจป้อม", "เณรานุสนธิ์", "นามเสวตร", "นิษประปัญจ์", "นิระหานี", "นิลสุวรรณ์",
    "นักรบ", "นิติสาขา", "นิยมธรรม", "นิลเสนา", "หนุนสุข", "นิลวิมล", "นฤภัย", "นาถะเดชะ",
    "นพตระกูล", "นิยมเซียม", "หนักแน่น", "นามขำ", "นานายน", "นับเนื่องนอ", "แนวพญา",
    "นาถะพินธุ", "นิลสลัว", "นะวะมันดร", "นิลวรรณ", "เนตร์มณี", "นุตตาร", "นิยมสำหรวจ",
    "นกทอง", "นุชแนวนุ่ม", "นาคสุทิน", "นพคเชนทร์", "นาคะนคร", "นิละทัต", "นาควงษ์",
    "นากกนก", "บุนยาภิสนท์", "บุญญาภิรมย์", "บุณยะภาชน์", "บินดี", "บุนยะศัพท์",
    "บุนยะตีรณะ", "บุญญาไลย์", "บุญบำรุง",)

    # thai suffix
    #https://th.wikipedia.org/wiki/%E0%B8%99%E0%B8%B2%E0%B8%A1%E0%B8%AA%E0%B8%81%E0%B8%B8%E0%B8%A5%E0%B8%9E%E0%B8%A3%E0%B8%B0%E0%B8%A3%E0%B8%B2%E0%B8%8A%E0%B8%97%E0%B8%B2%E0%B8%99
    suffix = ("ณ กาฬสินธุ์","ณ จัมปาศักดิ์","ณ เชียงใหม่","ณ ตะกั่วทุ่ง","ณ ถลาง","ณ นคร","ณ น่าน","ณ บางช้าง","ณ ป้อมเพชร์","ณ พัทลุง","ณ พิศณุโลก","ณ มโนรม","ณ มหาไชย","ณ ร้อยเอ็จ","ณ ระนอง","ณ ลำปาง","ณ ลำพูน","ณ วิเชียร","ณ สงขลา","ณ หนองคาย","ณ อุบล")