# coding=utf-8

from __future__ import unicode_literals
from .. import Provider as PersonProvider

class Provider(PersonProvider):
    formats = (
        '{{first_name}}{{last_name}}',
        '{{first_name}}{{last_name}}{{last_name}}'
    )

    first_names = (
        '김', '이', '최', '박', '정', '강', '조', '윤', '장', '임', '오', '한', '신', '서', '권', '황', '안',
        '송', '류', '홍', '전', '고', '문', '손', '양', '배', '조', '백', '허', '남', '심', '유', '노', '하',
        '전', '정', '곽', '성', '차', '유', '구', '우', '주', '임', '나', '신', '민', '진', '지', '엄', '원',
        '채', '천', '양', '공', '현', '방', '함', '염', '여', '추', '변', '도', '석', '소', '선', '설', '방',
        '마', '길', '위', '연', '명', '기', '금', '왕', '반', '옥', '육', '진', '인', '맹', '제', '탁', '모',
        '남궁', '어', '용', '편', '봉', '구', '예', '경', '사', '부', '황보', '가', '복', '계', '제갈', '사공',
        '선우', '팽', '견', '종', '승', '독고', '옹', '빙', '장', '추', '편', '아', '점', '흥', '낭', '해',
        '판', '초', '필', '궉', '근', '매', '동방', '호', '두', '미', '요', '야', '묵', '자', '만', '운',
        '환', '범', '창', '엽', '수', '애', '단', '순', '돈', '준', '묘', '담', '장곡', '어금', '강전', '삼',
        '저', '군', '교', '영', '후', '누', '소봉', '뇌', '망절', '원', '즙', '증'
    )

    last_names = (
        '재', '우', '지', '환', '현', '웅', '근', '철', '민', '정', '희', '성', '주', '다', '려', '빈', '영',
        '준', '진', '혁', '수', '대', '호', '향', '열', '순', '미', '연', '유', '리', '훈', '익', '혜', '은',
        '휘', '범', '두', '태', '황', '경', '통', '원', '하', '가', '람', '선', '관', '련', '보', '종', '소',
        '예', '석', '힘', '찬', '승', '상', '한', '별', '홍', '용', '아', '덕', '균', '의', '후', '구', '형',
        '규', '안', '강', '산', '명', '세', '효', '무', '협', '기', '억', '동', '완', '윤', '창', '도', '위',
        '엽', '온', '권', '병', '욱', '비', '화', '슬', '송', '광', '남', '인', '해', '양', '림', '란', '건',
        '솔', '금'
    )
